import { INews } from "../../models/INews";

const data: INews[] = [
    {
        id: 2064,
        date: "2023-10-10 18:37:30",
        relevant_score: 8.149099,
        msg: "**Байден заявил, что намерен в срочном порядке проработать с конгрессом выделение средств на нужды Израиля\n\n**Другие заявления:\n\n— США позаботятся о том, чтобы у Израиля были средства защиты от атак ХАМАС;\n\n— США предостерегают любую третью страну или организацию от попыток воспользоваться обострением палестино-израильского конфликта;\n\n— США готовы направить на Ближний Восток дополнительные военные силы в случае необходимости.",
        url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
    {
        id: 2065,
        date: "2023-04-10 14:37:38",
        relevant_score: 3.149099,
        msg: "🇷🇺🇵🇸🇮🇱**Путин: Для решения палестино-израильского конфликта нужна реализация решений Совбеза ООН по созданию независимого Палестинского государства\n\n▪️ Резкое обострение ситуации на Ближнем Востоке является ярким примером провала политики США в регионе.\n▪️ США пытались монополизировать урегулирование на Ближнем Востоке, но не были озабочены поиском компромиссов, приемлемых для обеих сторон.\n▪️ Америка оказывала давление на обе стороны палестино-израильского конфликта — каждый раз без учёта коренных интересов палестинского народа.\n▪️ Ущерб гражданскому населению должен быть минимизирован и сведён к нулю, призываем к этому все конфликтующие стороны.\n▪️Мы поддерживаем поиск мирного решения путём диалогов",
        // url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
    {
        id: 1232,
        date: "2023-16-06 16:24:30",
        relevant_score: 5.149099,
        msg: 'ПВО Израиля [истощено](https://t.me/IA_ASD/14484) массовыми пусками ракет. Запад спешно перебрасывает на Ближний Восток ЗРК и боеприпасы к ним, в том числе и из "украинских пакетов". То есть Киев еще не скоро получит столь необходимые ему ЗРК и ЗСУ',
        url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
    {
        id: 12312,
        date: "2023-16-06 16:24:30",
        relevant_score: 5.149099,
        msg: "Стало известно имя первого россиянина, погибшего в ходе событий в Израиле: это 47-летний уроженец калининградского Балтийска Денис Беленький, переехавший на Ближний Восток в 1992 году. У мужчины было двойное гражданство",
        url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
    {
        id: 12322,
        date: "2023-16-06 16:24:30",
        relevant_score: 5.149099,
        msg: "ГЕННАДИЙ АЛЁХИН\n«Адекватный харьковчанин» об уменьшении обстрелов Белгородчины и следах наёмников с Ближнего Востока в рядах украинских ДРГ:\n\n«Александр Валерьевич, несколько слов о ситуации на Северном  направлении Купянск-Харьков-Белгород. \n\nЗа минувшие выходные количество обстрелов со стороны ВСУ по приграничным районам Белгородской области сократилось. Тем не менее, в субботу противник атаковал с помощью реактивной системы залпового огня населенный пункт Уразово. К сожалению, есть жертвы среди мирного населения: скончался мужчина, не приходя в сознание, мирный житель Уразово.  Повержены домовладения и сельскохозяйственная техника, машины. \n\nСо стороны города Харькова были нанесены три удара с помощью оперативно-тактического комплекса «Точка-У». Он стреляет на дальность 70-80 километров стрельбы. Две ракеты были сбиты на подлете к городу Белгород, Яковлевский городской округ и дна ракета со стороны Новооскольского района. \n\nБыли обстрелы населенных пунктов Шебекинского городского округа. Жители Белгородчины иронизируют: либо у ВСУшников не осталось оружия и боеприпасов — они все отдали на ближний восток. Если говорить серьезно, естественно события на Ближ",
        url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
    {
        id: 112322,
        date: "2023-16-06 16:24:30",
        relevant_score: 5.149099,
        msg: "Президент РФ Владимир Путин на встрече с премьер-министром Ирака прокомментировал обострение ситуации на Ближнем Востоке:\n\n**— резкое обострение ситуации на Ближнем Востоке является ярким примером провала политики США в регионе;\n\n— США пытались монополизировать урегулирование на Ближнем Востоке, но не были озабочены поиском компромиссов, приемлемых для обеих сторон;\n\n— для урегулирования палестино-израильского конфликта нужна реализация решений СБ ООН по созданию суверенного палестинского государства;\n\n— США ока.",
        url: "https://t.me/topwar_official/77994",
        // photo: "localhost:8001/Photos/image5253752555547251902.jpg",
    },
];

export default data;
